#- telebo главная библиотека для работы с Telegram
import telebot
#types - инструмент для создания  клавиатур и кнопок
from telebot import types
# os - для работы с операционной системой (чтение файлов)
import os
#для загрузки секретного токена бота из файла .env
from dotenv import load_dotenv
print("🚀 ЗАПУСК БОТА ДЛЯ ПОДБОРА ВУЗОВ")

# Загружаем секретный токен
load_dotenv()
BOT_TOKEN = os.getenv("BOT_TOKEN")

if not BOT_TOKEN:
    print("❌ ОШИБКА: Токен не найден!")
    exit()

print(f"✅ Токен загружен: {BOT_TOKEN[:10]}...")

# Создаём бота, передавая ему токен
bot = telebot.TeleBot(BOT_TOKEN)
#Словарь для хранения данных каждого пользователя
# Ключ - ID пользователя, значение - словарь с его данными
user_data = {}

# БАЗА ВУЗОВ
#Каждый вуз — это словарь с ключами:
'''name — название
interests — подходящие интересы
· subjects — нужные предметы ЕГЭ
· min_score — минимальный балл
· description — описание'''

UNIVERSITIES = [
    {
        "name": "МГУ им. Ломоносова",
        "interests": ["🔬 Наука", "🏥 Медицина"],
        "subjects": ["📐 Математика", "🧪 Химия", "⚛️ Физика"],
        "min_score": 330,
        "description": "Ведущий вуз страны, сильные естественные науки"
    },
    {
        "name": "МФТИ",
        "interests": ["💻 IT", "⚛️ Физика"],
        "subjects": ["📐 Математика", "⚛️ Физика", "💻 Информатика"],
        "min_score": 310,
        "description": "Физтех, сильная физико-математическая подготовка"
    },
    {
        "name": "ВШЭ",
        "interests": ["📊 Экономика", "💻 IT"],
        "subjects": ["📐 Математика", "🌍 Обществознание"],
        "min_score": 280,
        "description": "Современный вуз с экономическими направлениями"
    },
    {
        "name": "МИФИ",
        "interests": ["📐 Инженерия", "💻 IT"],
        "subjects": ["📐 Математика", "⚛️ Физика"],
        "min_score": 260,
        "description": "Ядерные технологии, инженерия, IT"
    }
]

#  Список со словарем ПРОФТЕСТ. За ответ начислятся 2 балла, который сохраняются в категории
prof_test_questions = [
    {
        "question": "1. Что тебе больше нравится?",
        "options": ["🔍 Разбираться в причинах", "⚙️ Создавать своими руками",
                    "💬 Общаться и помогать", "📊 Анализировать данные"],
        "scores": [{"🔬": 2}, {"🔧": 2}, {"👥": 2}, {"📈": 2}]
    },
    {
        "question": "2. Какой школьный предмет интереснее?",
        "options": ["🧪 Химия/Биология", "⚛️ Физика/Информатика",
                    "🏛️ История/Общество", "📐 Математика"],
        "scores": [{"🔬": 3}, {"🔧": 3}, {"👥": 3}, {"📈": 3}]
    }
]

#Список результатов. Где будет больше очков, тот вариант и покажут
prof_results = {
    "🔬": {
        "name": "Естественно-научный профиль",
        "interests": ["🔬 Естественные науки", "🏥 Медицина"]
    },
    "🔧": {
        "name": "Технический профиль",
        "interests": ["💻 IT и программирование", "📐 Инженерия"]
    },
    "👥": {
        "name": "Социально-гуманитарный профиль",
        "interests": ["⚖️ Юриспруденция", "🎨 Дизайн и искусство"]
    },
    "📈": {
        "name": "Экономический профиль",
        "interests": ["📊 Экономика и финансы"]
    }
}


# ФУНКЦИИ ФИЛЬТРАЦИИ
#Подбор вузов
def filter_universities(interests, subjects, score):

    """Фильтрация вузов"""
    suitable = [] #список для подходящих вузов

    for uni in UNIVERSITIES: #проходимся по вузам
        # Проверяем совпадение
        #если список пустой с интересов вообще, то тоже, тру
        interest_ok = any(i in uni["interests"] for i in interests) if interests else True #хотя бы один интерес есть?
        subject_ok = any(s in uni["subjects"] for s in subjects) if subjects else True #хотя бы один предмет есть?
        score_ok = score >= uni["min_score"] - 20 if score else True #проверяем баллы,с запасом в 20 баллов

        if interest_ok and subject_ok and score_ok:#еслт все 3 проверки прошли
            uni_copy = uni.copy()#копируем инфо о  университете
            #расчитываем процент совпадение в вуз
            if score and uni["min_score"] > 0:#если баллы введеены и есть мин баллы вуза
                #создаем в словаре вуза новый ключ match для процента
                #вычисляем процент=баллы польз/мин былла, но если >95,то пишем 95,чтобы не было 100%
                uni_copy["match"] = min(95, int((score / uni["min_score"]) * 100))
            else:
                uni_copy["match"] = 70 #если быллов нет, то пишем 70%
            suitable.append(uni_copy) #добавляем в список инфор за вуз

    suitable.sort(key=lambda x: x["match"], reverse=True) #сортируем список с вузами подход по проценту по убыванию
    return suitable[:3] #выводим три самых подходящих вузов


#  Главное меню с кнопками в боте
#Создаем 4 кнопки, две слева и две справа
#types.ReplyKeyboardMarkup - создать клавиатура с кнопками
#resize_keyboard=True - подогнать размер кнопок под экран телефона
#row_width=2 - расположить кнопки по 2 ряда
def main_menu():
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=2)
    #добавляем сами кнопки
    markup.add(
        types.KeyboardButton("🎓 Начать подбор вуза"),
        types.KeyboardButton("🧩 Пройти профтест"),
        types.KeyboardButton("ℹ️ О боте"),
        types.KeyboardButton("📊 Мои данные")
    )
    return markup


#создаем клавиатуру с кнопками интересов
def interests_keyboard():
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=2)
    buttons = ["💻 IT", "🏥 Медицина", "📐 Инженерия", "📊 Экономика",
               "🎨 Дизайн", "⚖️ Право", "🔬 Наука", "➡️ Далее"]
    markup.add(*buttons)
    return markup

#создаем клавиатуру с кнопками предметов
def subjects_keyboard():
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=3)
    buttons = ["📐 Математика", "📚 Русский", "💻 Информатика",
               "🌍 Обществознание", "🧪 Химия", "⚛️ Физика",
               "🌎 Биология", "🏛️ История", "➡️ Далее"]
    markup.add(*buttons)
    return markup


#  ОСНОВНЫЕ ОБРАБОТЧИКИ
#Самое начало работы бота - start
@bot.message_handler(commands=['start']) #если введут команду start,то вызовется функция send_welcome
def send_welcome(message):
    user_id = message.from_user.id # сохраняем уникал номер пользователя в телеграм
    #создаем анкету пользователя в user_data
    user_data[user_id] = {
        "step": "start",
        "interests": [],
        "subjects": [],
        "score": None
    }

    #Приветственный текст, * чтобы текст был жирный
    text = """
    👋 *Привет, абитуриент!*

    Я помогу выбрать вуз в Москве:

    🎯 *Профтест* - если не знаешь, куда поступать
    🎓 *Прямой подбор* - если есть конкретные интересы

    Выбери действие:
        """
    #отправляем сообщение
    #message.chat.id - в тот же чат
    #text - что отправляем, выше написали
    #parse_mode = "Markdown" - чтобы * была как жирный текст
    #reply_markup=main_menu() - показывает клавиатуру с 4 кнопками, что ранее создали

    bot.send_message(message.chat.id, text, parse_mode="Markdown", reply_markup=main_menu())
    print(f"👤 Пользователь {user_id} запущен") #вывод в консоле

#декоратор с фильтром.
@bot.message_handler(func=lambda m: m.text == "🎓 Начать подбор вуза") #вызываем функцию, когда нажата кнопка
def start_selection(message):
    user_id = message.from_user.id #получаем id ползьвателя
    user_data[user_id]["step"] = "select_interests" #бот запоминает шаг текущий,чтобы знать, что пользователь булет делать
    bot.send_message(message.chat.id,
                     "🎯 *Выбери сферы интересов:*\n(можно несколько, затем «➡️ Далее»)",
                     parse_mode="Markdown", reply_markup=interests_keyboard())


@bot.message_handler(func=lambda m: m.text == "🧩 Пройти профтест")
def start_test(message):
    user_id = message.from_user.id
    user_data[user_id] = {
        "step": "prof_test",
        "test_q": 0,
        "test_scores": {"🔬": 0, "🔧": 0, "👥": 0, "📈": 0}
    }

    q = prof_test_questions[0]
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=2)
    for opt in q["options"]:
        markup.add(types.KeyboardButton(opt))

    bot.send_message(message.chat.id,
                     f"🧩 *Профтест (2 вопроса)*\n\n{q['question']}",
                     parse_mode="Markdown", reply_markup=markup)


@bot.message_handler(func=lambda m: m.text in [
    "🔍 Разбираться в причинах", "⚙️ Создавать своими руками",
    "💬 Общаться и помогать", "📊 Анализировать данные",
    "🧪 Химия/Биология", "⚛️ Физика/Информатика",
    "🏛️ История/Общество", "📐 Математика"
])

#функция ответа пользователя в проф тесте
def handle_test_answer(message):
    user_id = message.from_user.id #получает id пользователя
    #проверяем есть ли такой пользователь и проходит ли он проф тест
    if user_id not in user_data or user_data[user_id].get("step") != "prof_test":
        return # выходим если его нет

    q_num = user_data[user_id]["test_q"]#сохраняем номер текущего вопроса
    q = prof_test_questions[q_num]#сохраняем сам вопрос

    # Находим выбранный вариант
    found = False# переменная для совпадения ответа
    #проходим по всем вариантом ответа
    for i, opt in enumerate(q["options"]):
        if opt == message.text:#если текст совпал
            found = True#нашли ответ
            # Обрабатываем баллы (исправленная часть)
            score_items = q["scores"][i]#сохраняем очки для этого ответа

            # Проверяем структуру
            if isinstance(score_items, list):#это список?
                # Это список словарей тогда проходимся по списку
                for item in score_items:
                    if isinstance(item, dict):#если э-т списка словарь тогда проходимся про э-ам словоря
                        for prof, points in item.items():
                            user_data[user_id]["test_scores"][prof] += points#добавляем очки
                    else:
                        print(f"Неожиданный формат: {item}")
            elif isinstance(score_items, dict):
                # Это просто словарь
                for prof, points in score_items.items():
                    user_data[user_id]["test_scores"][prof] += points

            break

    if not found:
        return
    #если вариант введен, то переходим к след вопросу
    user_data[user_id]["test_q"] += 1

    # если вопросы еще есть
    if user_data[user_id]["test_q"] < len(prof_test_questions):
        # Следующий вопрос
        next_q = prof_test_questions[user_data[user_id]["test_q"]]
        markup = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=2) # создаем клавиутару для след вопроса
        for opt in next_q["options"]:
            markup.add(types.KeyboardButton(opt))#добавляем кнопки
        #отправляем след вопрос пользователю
        bot.send_message(message.chat.id,
                         f"🧩 Вопрос {user_data[user_id]['test_q'] + 1}/2\n\n{next_q['question']}",
                         parse_mode="Markdown", reply_markup=markup)
    else:
        # Показываем результаты
        scores = user_data[user_id]["test_scores"] #сохраняем все очки
        main_prof = max(scores, key=scores.get)#находим макс баллы по значению в словаре очков
        result = prof_results[main_prof]#сохраняем соответствующее описание вуза

        user_data[user_id]["prof_result"] = result["interests"] # сохраняем результаты в профиль пользователя
        user_data[user_id]["step"] = "test_done"# меняем данные пользователя на тест завершен

        text = f"🎯 *Твой профиль: {result['name']}*\n\n" #сохраняем сообщение вводное пользователю
        text += f"📋 Рекомендуемые сферы:\n"
        #проходимся по рекомендованным профессиям и добавляем подходящие
        for interest in result["interests"]:
            text += f"• {interest}\n"
        text += "\nТеперь можешь начать подбор вуза!"
        # отправляем сформированное сообщение пользователю
        bot.send_message(message.chat.id, text,
                         parse_mode="Markdown", reply_markup=main_menu())

#декоратор интересов
@bot.message_handler(func=lambda m: m.text in ["💻 IT", "🏥 Медицина", "📐 Инженерия",
                                               "📊 Экономика", "🎨 Дизайн", "⚖️ Право", "🔬 Наука"])
def handle_interests(message):#Получаем ID пользователя
    user_id = message.from_user.id
    # Если пользователь не в базе ИЛИ не на этапе выбора интересов, выходим (return)
    if user_id not in user_data or user_data[user_id].get("step") != "select_interests":
        return

    interest = message.text #Берём выбранный интерес
    #Создаём список интересов (если нет пустой список)
    if "interests" not in user_data[user_id]:
        user_data[user_id]["interests"] = []
    #Если интерес УЖЕ выбран, то удаляем из списка,
    if interest in user_data[user_id]["interests"]:
        user_data[user_id]["interests"].remove(interest)
        bot.send_message(message.chat.id, f"❌ Убрано: {interest}")
    else:#Если интерес НЕ выбран ,добавляем в список, пишем "Добавлено:
        user_data[user_id]["interests"].append(interest)
        bot.send_message(message.chat.id, f"✅ Добавлено: {interest}")

    ints = user_data[user_id]["interests"]
    if ints:#Показываем текущий список через запятую
        bot.send_message(message.chat.id, f"📋 Твои интересы: {', '.join(ints)}")

#декоратор кнопки далее
@bot.message_handler(func=lambda m: m.text == "➡️ Далее")
def handle_next(message):
    user_id = message.from_user.id #Получаем ID пользователя
    #Если пользователя нет в базе,выходим
    if user_id not in user_data:
        return

    step = user_data[user_id].get("step") #на каком шаге пользователь

    # Если этап = выбор интересов
    if step == "select_interests":
        user_data[user_id]["step"] = "select_subjects" #Меняем этап на "select_subjects" (выбор предметов)
        # #Показываем сообщение с инструкцией и клавиатуру предметов
        bot.send_message(message.chat.id,
                         "📚 *Выбери любимые предметы:*\n(можно несколько, затем «➡️ Далее»)",
                         parse_mode="Markdown", reply_markup=subjects_keyboard())

    elif step == "select_subjects":#Если этап = выбор предметов
        user_data[user_id]["step"] = "enter_score" #Меняем этап на "enter_score"
        remove = types.ReplyKeyboardRemove() #убираем все кнопки
        #Просим ввести баллы ЕГЭ
        bot.send_message(message.chat.id,
                         "📊 *Введи примерные баллы ЕГЭ (150-400):*\nНапример: 240",
                         parse_mode="Markdown", reply_markup=remove)

#декоратор предметов
@bot.message_handler(func=lambda m: m.text in ["📐 Математика", "📚 Русский", "💻 Информатика",
                                               "🌍 Обществознание", "🧪 Химия", "⚛️ Физика",
                                               "🌎 Биология", "🏛️ История"])
def handle_subjects(message):

    user_id = message.from_user.id#Получаем ID
    #Если пользователь не в базе ИЛИ не на этапе выбора интересов, выходим
    if user_id not in user_data or user_data[user_id].get("step") != "select_subjects":
        return

    subject = message.text #Берём выбранный интерес
    # Если ключа "interests" нет,создаём пустой список
    if "subjects" not in user_data[user_id]:
        user_data[user_id]["subjects"] = []

    if subject in user_data[user_id]["subjects"]:#Если интерес УЖЕ выбран, удаляем
        user_data[user_id]["subjects"].remove(subject)
        bot.send_message(message.chat.id, f"❌ Убрано: {subject}")
    else:
        user_data[user_id]["subjects"].append(subject)#Если интерес НЕ выбран,добавляем
        bot.send_message(message.chat.id, f"✅ Добавлено: {subject}")
    #Показываем текущий список через запятую
    subs = user_data[user_id]["subjects"]
    if subs:
        bot.send_message(message.chat.id, f"📖 Твои предметы: {', '.join(subs)}")

##декоратор баллов
@bot.message_handler(func=lambda m: m.text and m.text.isdigit())
def handle_score(message):
    user_id = message.from_user.id #Получаем ID
    #сли этого пользователя нет в user_data — выходим
    if user_id not in user_data or user_data[user_id].get("step") != "enter_score":
        return

    score = int(message.text) #Преобразуем текст в число
    if 150 <= score <= 400: #Проверяем диапазон баллов
        user_data[user_id]["score"] = score #записываем баллы в анкету

        # Подбор вузов
        ints = user_data[user_id].get("interests", []) #Получаем выбранные интересы
        subs = user_data[user_id].get("subjects", []) #предметы

        universities = filter_universities(ints, subs, score) #получаем 3 университета

        # Формируем ответ
        text = f"🎉 *Результаты для {score} баллов:*\n\n"

        if universities:#Если вузы найдены
            for uni in universities: #Перебираем каждый вуз из списка
                text += f"• *{uni['name']}* ({uni['match']}%)\n" #Добавляем в текст: название, процент совпадения
                text += f"  {uni['description']}\n\n" # описание
        else:#Если вузов не найдено
            text += "😔 Не найдено подходящих вузов.\n"
            text += "Попробуй расширить интересы или пройти профтест.\n\n"

        text += "Для нового поиска нажми /start"

        #Отправляем результат
        bot.send_message(message.chat.id, text,
                         parse_mode="Markdown", reply_markup=main_menu())
    else: #Если баллы меньше 150 или больше 400 — отправляем ошибку
        bot.send_message(message.chat.id, "Введите число от 150 до 400")

#декоратор кнопки О боте
@bot.message_handler(func=lambda m: m.text == "ℹ️ О боте")
def about_bot(message):
    text = """
        🤖 *О БОТЕ*

        Проект по информатике, 10 класс.
        Помогает абитуриентам выбрать вуз в Москве.
            """
    bot.send_message(message.chat.id, text, parse_mode="Markdown")

#декоратор мои данные
@bot.message_handler(func=lambda m: m.text == "📊 Мои данные")
def show_stats(message):
    user_id = message.from_user.id
    data = user_data.get(user_id, {})

    # Получаем данные (даже если их нет — подставляем значения по умолчанию)
    interests = data.get('interests', [])
    subjects = data.get('subjects', [])
    step = data.get('step', 'не начат')
    score = data.get('score', 'не указаны')
    prof_result = data.get('prof_result', [])

    # Красиво оформляем интересы и предметы
    interests_text = ', '.join(interests) if interests else 'не выбраны'
    subjects_text = ', '.join(subjects) if subjects else 'не выбраны'

    # Формируем текст
    text = f"""
📊 *ТВОИ ДАННЫЕ*

• Этап: {step}
• Интересы: {interests_text}
• Предметы: {subjects_text}
• Баллы ЕГЭ: {score}
    """

    if prof_result:
        text += "• Профтест: пройден ✅\n"
        text += f"  Рекомендовано: {', '.join(prof_result)}\n"

    bot.send_message(message.chat.id, text, parse_mode="Markdown", reply_markup=main_menu())



'''@bot.message_handler(func=lambda m: m.text == "📊 Мои данные")
def show_stats(message):
    user_id = message.from_user.id #Получаем ID пользователя
    data = user_data.get(user_id, {})

    text = f"""
        📊 *ТВОЯ СТАТИСТИКА*

        • Этап: {data.get('step', 'не начат')}
        • Интересы: {len(data.get('interests', []))}
        • Предметы: {len(data.get('subjects', []))}
        • Баллы: {data.get('score', 'не указаны')}
        """

    if data.get("prof_result"):
        text += "• Профтест: пройден ✅\n"

    bot.send_message(message.chat.id, text, parse_mode="Markdown")'''

#декоратор всех других случаев
@bot.message_handler(func=lambda m: True)
def handle_other(message):
    bot.send_message(message.chat.id,
                     "Используй кнопки меню 👆\n/start - начать заново",
                     reply_markup=main_menu())

#ЗАПУСК БОТА
print("=" * 60)
print("✅ БОТ ЗАПУЩЕН! Напишите /start в Telegram")
print("=" * 60)

bot.polling(none_stop=True)
